GENDER_CHOICES = {
    'Мужской': 'М',
    'Женский': 'Ж',
}

PERSONAL_TYPES = ['name', 'gender', 'birthdate', 'email', 'occupation',
                  'telegram_id']

ABOUT_TEST_TEXT = """
    Когнитивные способности напрямую связаны с работой различных отделов мозга. Их функционирование обеспечивает нашу продуктивность и выполнение различных задач в повседневной жизни.
    \nС возрастом работа отделов мозга становится менее эффективной, поэтому наблюдение за своим когнитивным состоянием и состоянием своих близких дает возможность раннего диагностирования когнитивных нарушений.
    \nЭто позволяет замедлить прогрессирование симптомов когнитивных расстройств, избежать их хронического характера и как можно раньше начать лечение.\n
    \nДанный тест рекомендуется пройти для проверки своего когнитивного статуса.
"""


HELP_TEST_TEXT = """
    Как выполнять тест?
    \nВо время прохождения теста нельзя использовать калькулятор, календарь, часы. Вам необходимо сделать максимальное количество заданий.
    \n1. Для правильного прохождения вопросов с рисунками (2 вопроса в тесте) и корректной оценки результатов ответов по данным вопросам, связанных с распознаванием изображений, вам необходимо использовать:
    \nБелый лист бумаги, без клеток, неразлинованный, размер не менее А5 (можно А4). Рисунок должен быть крупный, располагаться на всем размере листа или большей его части;
    \nРучку черного цвета (ручка иных цветов или карандаш не будут распознаны системой);
    \nВы также можете отредактировать фотографию рисунка и сделать ее черно-белой.
    \n2. Фото рисунка необходимо сделать сверху. Освещение должно быть максимально ярким (дневное, под лампой, без тени от устройства).
    \n3. Фотография должна содержать ТОЛЬКО тестируемый рисунок. Если в фото кадр попали не относящиеся к рисунку элементы, рекомендуется обрезать изображение или сделать новый снимок.
"""

TEST_URL = 'https://testing.xn--d1acamsh7dwd.net/testUser/1/'


START_MESSAGE = "Для работы с ботом используйте доступные команды меню."

BOT_COMMANDS = {
    "test": "Тестирование",
    "start": "Старт",
}