GENDER_CHOICES = {
    'Мужской': 'М',
    'Женский': 'Ж',
}

PERSONAL_TYPES = ['name', 'gender', 'birthdate', 'email', 'occupation',
                  'telegram_id']

ABOUT_TEST_TEXT = """
    Тест состоит из вопросов и заданий, оценивающих память и внимание, аналитические способности, ориентацию во времени и пространстве.  
    \nЕсли готовы проверить свой когнитивный статус,доставайте любые листочки и ручку - задания уже ждут вас в тесте!
    \nКто на когнитивный чек-ап? ;)
"""


HELP_TEST_TEXT = """
    Как выполнять тест?
    \nВо время прохождения теста нельзя использовать калькулятор, календарь, часы. Вам необходимо сделать максимальное количество заданий.
    \n1. Для правильного прохождения вопросов с рисунками (2 вопроса в тесте) и корректной оценки результатов ответов по данным вопросам, связанных с распознаванием изображений, вам необходимо использовать:
    \nБелый лист бумаги, без клеток, неразлинованный, размер не менее А5 (можно А4). Рисунок должен быть крупный, располагаться на всем размере листа или большей его части;
    \nРучку черного цвета (ручка иных цветов или карандаш не будут распознаны системой);
    \nВы также можете отредактировать фотографию рисунка и сделать ее черно-белой.
    \n2. Фото рисунка необходимо сделать сверху. Освещение должно быть максимально ярким (дневное, под лампой, без тени от устройства).
    \n3. Фотография должна содержать ТОЛЬКО тестируемый рисунок. Если в фото кадр попали не относящиеся к рисунку элементы, рекомендуется обрезать изображение или сделать новый снимок.
"""
# Ссылка на тест
TEST_URL = 'https://testing.xn--d1acamsh7dwd.net/testUser/'

# Стартовое сообщение с сылкой на сайт проекта
START_MESSAGE = """
    \nМы знаем ответы на самые разные вопросы о деменции, и хотим поделиться с вами своими знаниями\.
    \nЕсли вы думали, что деменция наступает только в старости, на это мы можем только отрицательно покачать головой 🫨
"""
PROJECT_LINK_TITLE = "Деменция.net"
PROJECT_LINK = "https://xn--d1acamsh7dwd.net/"

# Команды бота
BOT_COMMANDS = {
    "test": "Тестирование",
    "start": "Старт",
}

# Кнопки теста
INFO_TEST_BUTTON = "Пройти тест"
START_TEST_BUTTON = "Проверить себя"

# Описание при первом переходе в бота
BOT_LONG_DESCRIPTION = "Поддержание интеллектуальной формы можно начать с диагностики, и, чтобы вам не нужно было далеко ходить, мы создали чат-бот с SAGE-тестированием на наличие когнитивных изменений, которое можно пройти прямо сейчас."
BOT_SHORT_DESCRIPTION = "Чат-бот с SAGE-тестированием на наличие когнитивных изменений, которое можно пройти прямо сейчас!"
